In [70]:
import pandas as pd
import numpy as np

In [71]:
from numpy.random import randn
np.random.seed(10)

In [72]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='F G H I'.split())

In [73]:
df

          F         G         H         I
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [74]:
print(type(df))
print(type(df['F']))
print(df['F']['A'])

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
1.331586504129518

In [75]:
df['J']=df['F']+df['H']

In [76]:
df

          F         G         H         I         J
A  1.331587  0.715279 -1.545400 -0.008384 -0.213814
B  0.621336 -0.720086  0.265512  0.108549  0.886848
C  0.004291 -0.174600  0.433026  1.203037  0.437318
D -0.965066  1.028274  0.228630  0.445138 -0.736436
E -1.136602  0.135137  1.484537 -1.079805  0.347935

In [77]:
df.drop('J',axis=1)

          F         G         H         I
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [78]:
df

          F         G         H         I         J
A  1.331587  0.715279 -1.545400 -0.008384 -0.213814
B  0.621336 -0.720086  0.265512  0.108549  0.886848
C  0.004291 -0.174600  0.433026  1.203037  0.437318
D -0.965066  1.028274  0.228630  0.445138 -0.736436
E -1.136602  0.135137  1.484537 -1.079805  0.347935

In [79]:
df.drop('J',axis=1,inplace=True)

In [80]:
df

          F         G         H         I
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [81]:
df.drop('E',axis=0)

          F         G         H         I
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138

In [82]:
df.loc['B'] #same as df.iloc[1]

F    0.621336
G   -0.720086
H    0.265512
I    0.108549
Name: B, dtype: float64

In [83]:
df.iloc[1]

F    0.621336
G   -0.720086
H    0.265512
I    0.108549
Name: B, dtype: float64

In [84]:
df.loc['B','G'] #same as df.iloc[1,1]

-0.7200855607188968

In [85]:
df.iloc[1,1]

-0.7200855607188968

In [86]:
df.loc[['A','B'],['F','G']]

          F         G
A  1.331587  0.715279
B  0.621336 -0.720086

In [87]:
df>0

       F      G      H      I
A   True   True  False  False
B   True  False   True   True
C   True  False   True   True
D  False   True   True   True
E  False   True   True  False

In [88]:
df[df>0]

          F         G         H         I
A  1.331587  0.715279       NaN       NaN
B  0.621336       NaN  0.265512  0.108549
C  0.004291       NaN  0.433026  1.203037
D       NaN  1.028274  0.228630  0.445138
E       NaN  0.135137  1.484537       NaN

In [89]:
df[df['F']>0]

          F         G         H         I
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037

In [90]:
df

          F         G         H         I
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [91]:
df.reset_index()

  index         F         G         H         I
0     A  1.331587  0.715279 -1.545400 -0.008384
1     B  0.621336 -0.720086  0.265512  0.108549
2     C  0.004291 -0.174600  0.433026  1.203037
3     D -0.965066  1.028274  0.228630  0.445138
4     E -1.136602  0.135137  1.484537 -1.079805

In [92]:
newindex = 'CA NY WY OR CO'.split()
df['States'] = newindex

In [93]:
df

          F         G         H         I States
A  1.331587  0.715279 -1.545400 -0.008384     CA
B  0.621336 -0.720086  0.265512  0.108549     NY
C  0.004291 -0.174600  0.433026  1.203037     WY
D -0.965066  1.028274  0.228630  0.445138     OR
E -1.136602  0.135137  1.484537 -1.079805     CO

In [94]:
df.set_index('States') #temporary state

               F         G         H         I
States
CA      1.331587  0.715279 -1.545400 -0.008384
NY      0.621336 -0.720086  0.265512  0.108549
WY      0.004291 -0.174600  0.433026  1.203037
OR     -0.965066  1.028274  0.228630  0.445138
CO     -1.136602  0.135137  1.484537 -1.079805

In [95]:
df

          F         G         H         I States
A  1.331587  0.715279 -1.545400 -0.008384     CA
B  0.621336 -0.720086  0.265512  0.108549     NY
C  0.004291 -0.174600  0.433026  1.203037     WY
D -0.965066  1.028274  0.228630  0.445138     OR
E -1.136602  0.135137  1.484537 -1.079805     CO

In [96]:
df.set_index('States',inplace=True) #permanent change

In [97]:
df

               F         G         H         I
States
CA      1.331587  0.715279 -1.545400 -0.008384
NY      0.621336 -0.720086  0.265512  0.108549
WY      0.004291 -0.174600  0.433026  1.203037
OR     -0.965066  1.028274  0.228630  0.445138
CO     -1.136602  0.135137  1.484537 -1.079805

In [98]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [99]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [100]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B']) #nearly equal divisions of data
df

             A         B
G1 1 -1.977728 -1.743372
   2  0.266070  2.384967
   3  1.123691  1.672622
G2 1  0.099149  1.397996
   2 -0.271248  0.613204
   3 -0.267317 -0.549309

In [101]:
df.loc['G1']

          A         B
1 -1.977728 -1.743372
2  0.266070  2.384967
3  1.123691  1.672622

In [102]:
df.loc['G2']

          A         B
1  0.099149  1.397996
2 -0.271248  0.613204
3 -0.267317 -0.549309

In [103]:
df.loc['G1'].loc[1] #index-1 of G1

A   -1.977728
B   -1.743372
Name: 1, dtype: float64

In [104]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1   -1.977728 -1.743372
      2    0.266070  2.384967
      3    1.123691  1.672622
G2    1    0.099149  1.397996
      2   -0.271248  0.613204
      3   -0.267317 -0.549309

In [105]:
df.xs('G1')

            A         B
Num
1   -1.977728 -1.743372
2    0.266070  2.384967
3    1.123691  1.672622

In [107]:
df.xs(['G1',1])

C:\Users\KIIT\AppData\Local\Temp/ipykernel_12272/580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -1.977728
B   -1.743372
Name: (G1, 1), dtype: float64

In [109]:
df.xs(1,level='Num') #index 1 of G1 and G2

              A         B
Group
G1    -1.977728 -1.743372
G2     0.099149  1.397996

In [110]:
df

                  A         B
Group Num
G1    1   -1.977728 -1.743372
      2    0.266070  2.384967
      3    1.123691  1.672622
G2    1    0.099149  1.397996
      2   -0.271248  0.613204
      3   -0.267317 -0.549309